cf/InformationRegisters/UserSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>UserSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Value</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.UserSettings</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Setting</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.UserSettings</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Enums/YesNo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>YesNo</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Yes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>No</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/CommonForms/DeleteDialogYesNoDoNotAskAgain/Ext/Form/Module.bsl
&AtClient
Procedure Yes(Command)
	
	If DontAskAgain Then
		SetDoNotAskAnyMore(True);
	EndIf;
	
	Close(DialogReturnCode.Yes);
	
EndProcedure

&AtClient
Procedure No(Command)
	
	If DontAskAgain Then
		SetDoNotAskAnyMore(False);
	EndIf;
	
	Close();
	
EndProcedure

&AtServerNoContext
Procedure SetDoNotAskAnyMore(YesNoSettingVariant)
	
	User = Users.CurrentUser();
	
	RecordSet = InformationRegisters.UserSettings.CreateRecordSet();
	
	RecordSet.Filter.User.Use = True;
	RecordSet.Filter.User.Value = User;
	RecordSet.Filter.Settings.Use = True;
	RecordSet.Filter.Settings.Value = ChartsOfCharacteristicTypes.UserSettings.OffsetAdvancesDebtsAutomatically;
	
	Record = RecordSet.Add();
	
	Record.User = User;
	Record.Settings = ChartsOfCharacteristicTypes.UserSettings.OffsetAdvancesDebtsAutomatically;
	If YesNoSettingVariant Then
		Record.Value = ChartsOfCharacteristicTypes.UserSettings.OffsetAdvancesDebtsAutomatically.ValueType.AdjustValue(Enums.YesNo.Yes);
	Else
		Record.Value = ChartsOfCharacteristicTypes.UserSettings.OffsetAdvancesDebtsAutomatically.ValueType.AdjustValue(Enums.YesNo.No);
	EndIf;
	
	RecordSet.Write();
	
	RefreshReusableValues();
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ThisForm.Title = Parameters.HeaderText;
	Items.TextDecoration.Title = Parameters.HeaderText;
	
EndProcedure
